tap "aws/tap"
tap "cartr/qt4"
tap "d12frosted/emacs-plus"
tap "getsentry/tools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "kylef/formulae"
tap "mongodb/brew"
tap "vapor/tap"
brew "ascii"
brew "automake"
brew "batik"
brew "readline"
brew "glib"
brew "cairo"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "dbus"
brew "direnv"
brew "pkg-config"
brew "gnutls"
brew "emacs", link: false
brew "fasd"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "jpeg"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "geckodriver"
brew "ghc"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "python@3.8"
brew "global"
brew "gnu-time"
brew "libksba"
brew "gnupg"
brew "gts"
brew "pango"
brew "graphviz"
brew "gti"
brew "highlight"
brew "homeshick"
brew "htop"
brew "hub"
brew "libde265"
brew "imagemagick"
brew "imagemagick@6"
brew "ispell"
brew "jq"
brew "jrnl"
brew "krb5"
brew "lazygit"
brew "librsvg"
brew "libssh2"
brew "libvterm"
brew "libyaml"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "lynx"
brew "mas"
brew "md5sha1sum", link: false
brew "mosh"
brew "mr"
brew "mysql"
brew "nmap"
brew "node"
brew "openblas"
brew "openvpn"
brew "pandoc"
brew "pipenv"
brew "plantuml"
brew "poppler"
brew "postgresql"
brew "psgrep"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@2", link: false
brew "python@3.7"
brew "quicktype"
brew "r"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "shpotify"
brew "sl"
brew "socat"
brew "telnet"
brew "texinfo"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tldr"
brew "tmux"
brew "tree"
brew "unoconv"
brew "w3m"
brew "wakatime-cli"
brew "watchexec"
brew "wget"
brew "yamllint"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "getsentry/tools/sentry-cli"
brew "heroku/brew/heroku"
brew "kylef/formulae/swiftenv"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongosh"
brew "vapor/tap/vapor"
cask "1password"
cask "aerial"
cask "amethyst"
cask "betterzip"
cask "brave-browser-dev"
cask "chromedriver"
cask "dotnet-sdk"
cask "dropbox"
cask "emacsclient"
cask "firefox-developer-edition"
cask "firefox-esr"
cask "font-3270-nerd-font"
cask "font-cousine-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-meslo-nerd-font"
cask "font-monoid-nerd-font"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "font-sourcecodepro-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "growlnotify"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "launchrocket"
cask "mactex"
cask "mongodb-compass"
cask "multifirefox"
cask "navicat-for-postgresql"
cask "ngrok"
cask "now"
cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "qutebrowser"
cask "spotify"
cask "suspicious-package"
cask "tunnelblick"
cask "vagrant-manager"
cask "vlc"
cask "webpquicklook"
cask "xquartz"
cask "xscope"
mas "Be Focused Pro", id: 961632517
mas "Browser Fairy", id: 483014855
mas "Chrono Plus", id: 946047238
mas "com.inovize.fluid", id: 1077036385
mas "Copied", id: 1026349850
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Display Menu", id: 549083868
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Growl", id: 467939042
mas "Jira", id: 1475897096
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "LiveReload", id: 482898991
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "PopClip", id: 445189367
mas "ReadKit", id: 588726889
mas "Simplify", id: 448003584
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "StatusClock", id: 552792489
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 409789998
mas "Xcode", id: 497799835
mas "XmlSpy", id: 1254478180
mas "Yoink", id: 457622435
