tap "cartr/qt4"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "kylef/formulae"
tap "vapor/tap"
cask "xquartz"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Vector graphics library with cross-device output support
brew "cairo"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Message bus system, providing inter-application communication
brew "dbus"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Image manipulation library
brew "jpeg"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Source code tag system
brew "global"
# GNU implementation of time utility
brew "gnu-time"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# View and navigate through PostScript and PDF documents
brew "gv"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Open h.265 video codec implementation
brew "libde265"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Multiple Repository management tool
brew "mr"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Source code cross-referencer like ctags with a clang frontend
brew "rtags"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Convert between any document format supported by OpenOffice
brew "unoconv"
# Pager/text based browser
brew "w3m"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD"]
# Swift version manager
brew "kylef/formulae/swiftenv"
brew "vapor/tap/vapor"
cask "aerial"
cask "betterzip"
cask "chromedriver"
cask "dropbox"
cask "firefox-developer-edition"
cask "firefox-esr"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "growlnotify"
cask "iterm2"
cask "java8"
cask "keycastr"
cask "launchrocket"
cask "mactex"
cask "multifirefox"
cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "qutebrowser"
cask "r-app"
cask "spotify"
cask "squirrelsql"
cask "suspicious-package"
cask "tunnelblick"
cask "vagrant-manager"
cask "virtualbox"
cask "vlc"
cask "webpquicklook"
mas "Be Focused Pro", id: 961632517
mas "Chrono Plus", id: 946047238
mas "com.inovize.fluid", id: 1077036385
mas "Copied", id: 1026349850
mas "DaisyDisk", id: 411643860
mas "Display Menu", id: 549083868
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Growl", id: 467939042
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "LiveReload", id: 482898991
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "ReadKit", id: 588726889
mas "Slack", id: 803453959
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 409789998
mas "Xcode", id: 497799835
mas "XmlSpy", id: 1254478180
mas "Yoink", id: 457622435
